Repository: IT-Service-WordPress/itg-cache-control-headers
Catalog: languages/itg-cache-control-headers-*.po
Languages: ru_ru

source: ITG Cache-Control headers
ru_ru: ITG Cache-Control

source: Automatically send HTTP 1.1 headers "Cache-control", "Pragma" and "Expires" (<a href="http://tools.ietf.org/html/rfc7234" target="_blank">RFC 7234</a>).
ru_ru: Плагин позволяет формировать заголовки HTTP 1.1 "Cache-control", "Pragma", "Expires" и другие (<a href="http://tools.ietf.org/html/rfc7234" target="_blank">RFC 7234</a>).

source: Sergey S. Betke
ru_ru: Бетке Сергей Сергеевич

source: RFC 7234 HTTP 1.1 Cache-Control headers options
ru_ru: RFC 7234 Параметры Cache-Control

source: <code>Cache-Control</code> rewrite mode
ru_ru: Перезапись заголовков

source: <code>Cache-Control</code> header overwrite mode.
ru_ru: Режим перезаписи заголовка <code>Cache-Control</code>

source: Don't modify or add
ru_ru: Не добавлять и не модифицировать

source: Don't overwrite
ru_ru: Не переопределять (если уже присутствует)

source: Rewrite
ru_ru: Всегда переписывать

source: Append
ru_ru: Дописывать

source: Unexpected option <code>%4$s</code> value (<code>%2$s</code>).
ru_ru: Для опции <code>%4$s</code> указано недопустимое значение (<code>%2$s</code>).

source: Disable cache for headers
ru_ru: Запретить кэширование для заголовков

source: Disable cache for specified HTTP headers, but enable cache for other parts of response. <code>*</code> - fully disable server, client (browser) and proxy servers cache, <code>""</code> - don't disable cache. <a href="http://tools.ietf.org/html/rfc7234#section-5.2.2.2" target="_blank"><code>no-cache</code></a> parameter of <code>Cache-Control</code> header.
ru_ru: Запретить кэширование указанных заголовков HTTP, но разрешить кэширование остальной части ответа. <code>*</code> - полностью запретить кэширование ответов, как на прокси-серверах, так и в браузерах, <code>""</code> - не запрещать кэширование. Параметр <a href="http://tools.ietf.org/html/rfc7234#section-5.2.2.2" target="_blank"><code>no-cache</code></a> заголовка <code>Cache-Control</code>.

source: Invalid %2$s parameter %1$s value. Must be empty string, <code>*</code> or comma separated HTTP headers list.
ru_ru: Неверное значение параметра %1$s заголовка %2$s. Допустимые значения: пустая строка, <code>*</code> или разделённый запятыми список заголовков HTTP.

source: Disable permanent cache storage
ru_ru: Запретить долговременное кэширование

source: Disable permanent cache storage (for security reasons) - <a href="http://tools.ietf.org/html/rfc7234#section-5.2.2.3" target="_blank"><code>no-store</code></a> parameter of <code>Cache-Control</code> header.
ru_ru: Запретить долговременное (не в оперативной памяти) кэширование (из соображений безопасности) - параметр <a href="http://tools.ietf.org/html/rfc7234#section-5.2.2.3" target="_blank"><code>no-store</code></a> заголовка <code>Cache-Control</code>.

source: Enable public cache
ru_ru: Разрешить общий кэш

source: Enable public cache (client (browser) and proxy servers cache) - <a href="http://tools.ietf.org/html/rfc7234#section-5.2.2.5" target="_blank"><code>public</code></a> parameter of <code>Cache-Control</code> header.
ru_ru: Разрешить публичное (общее) кэширование (кэш браузеров и кэш прокси серверов) - параметр <a href="http://tools.ietf.org/html/rfc7234#section-5.2.2.5" target="_blank"><code>public</code></a> заголовка <code>Cache-Control</code>.

source: Disable public cache for headers
ru_ru: Запретить общее кэширование для заголовков

source: Disable public cache for specified HTTP headers, but don't disable public cache for other parts of response. <code>*</code> - fully disable public (proxy servers) cache, <code>""</code> - don't disable public cache. <a href="http://tools.ietf.org/html/rfc7234#section-5.2.2.6" target="_blank"><code>private</code></a> parameter of <code>Cache-Control</code> header.
ru_ru: Запретить общее кэширование указанных заголовков HTTP, но не запрещать общее кэширование остальной части ответа. <code>*</code> - полностью запретить кэш на прокси серверах, <code>""</code> - не запрещать кэширование на прокси серверах. Параметр <a href="http://tools.ietf.org/html/rfc7234#section-5.2.2.6" target="_blank"><code>private</code></a> заголовка <code>Cache-Control</code>.

source: Default <code>max-age</code> value
ru_ru: <code>max-age</code> (по умолчанию)

source: seconds
ru_ru: секунд

source: Default <a href="http://tools.ietf.org/html/rfc7234#section-5.2.2.8" target="_blank"><code>max-age</code></a> value (max cache time-to-live, seconds) for html wordpress pages.
ru_ru: Значение по умолчанию параметра <a href="http://tools.ietf.org/html/rfc7234#section-5.2.2.8" target="_blank"><code>max-age</code></a> (максимальное время жизни в кэше, в секундах) для генерируемых wordpress страниц.

source: %2$s parameter %1$s must be positive integer.
ru_ru: Значение параметра %1$s заголовка %2$s должно быть целым положительным числом.

source: Doesn't use stale cache
ru_ru: Не использовать устаревшее содержимое кэша

source: If cache content to become stale, a cache <strong>must not</strong> use the response to satisfy requests without successful validation on the origin server. <a href="http://tools.ietf.org/html/rfc7234#section-5.2.2.1" target="_blank"><code>must-revalidate</code></a> parameter of <code>Cache-Control</code> header.
ru_ru: Запрещает кэшу отдавать содержимое, срок жизни которого истёк, а обновить содержимое нет возможности в связи с недоступностью исходного сервера. Без данного параметра в случае недоступности исходного сервера устаревшее содержимое может быть возвращено кэшем при ответе на запрос. Параметр <a href="http://tools.ietf.org/html/rfc7234#section-5.2.2.1" target="_blank"><code>must-revalidate</code></a> заголовка <code>Cache-Control</code>.

source: Doesn't use stale cache on proxy servers
ru_ru: Не использовать устаревшее содержимое кэша на прокси серверах

source: If cache content on proxy servers to become stale, a cache <strong>must not</strong> use the response to satisfy requests without successful validation on the origin server. But private (browser) cache can use stale content. <a href="http://tools.ietf.org/html/rfc7234#section-5.2.2.7" target="_blank"><code>proxy-revalidate</code></a> parameter of <code>Cache-Control</code> header.
ru_ru: Запрещает прокси серверам отдавать содержимое, срок жизни которого истёк, а обновить содержимое нет возможности в связи с недоступностью исходного сервера. Без данного параметра в случае недоступности исходного сервера устаревшее содержимое может быть возвращено кэшем при ответе на запрос. Этот параметр не влияет на личный кэш (кэш браузера). Параметр <a href="http://tools.ietf.org/html/rfc7234#section-5.2.2.7" target="_blank"><code>proxy-revalidate</code></a> заголовка <code>Cache-Control</code>.

source: Don't transform content parts in cache
ru_ru: Не преобразовывать содержимое в кэше

source: Cache (regardless of whether it implements a cache) <strong>must not</strong> transform the payload, as defined in <a href="http://tools.ietf.org/html/rfc7230#section-5.7.2" target="_blank">Section 5.7.2 of RFC 7230</a>. <a href="http://tools.ietf.org/html/rfc7234#section-5.2.2.4" target="_blank"><code>no-transform</code></a> parameter of <code>Cache-Control</code> header.
ru_ru: Запрещает кэшу (вне зависимости от того, где он реализован) преобразовывать форматы содержимого при кэшировании (<a href="http://tools.ietf.org/html/rfc7230#section-5.7.2" target="_blank">п. 5.7.2 RFC 7230</a>). Параметр <a href="http://tools.ietf.org/html/rfc7234#section-5.2.2.4" target="_blank"><code>no-transform</code></a> заголовка <code>Cache-Control</code>.

source: Second cache keys
ru_ru: Вторичные ключи для кэша

source: List of request headers, for different values of which responses may be different. <a href="http://tools.ietf.org/html/rfc7234#section-4.1" target="_blank"><code>Vary</code></a> header.
ru_ru: Список заголовков запроса, для различных значений которых ответы сервера могут быть различными. Заголовок <a href="http://tools.ietf.org/html/rfc7234#section-4.1" target="_blank"><code>Vary</code></a>.

source: Invalid HTTP header %1$s value. Must be empty string, <code>*</code> or comma separated HTTP headers list.
ru_ru: Неверное значение заголовка %1$s. Допустимые значения: пустая строка, <code>*</code> или разделённый запятыми список заголовков HTTP.

source: RFC 5861 HTTP Cache-Control Extensions for Stale Content
ru_ru: RFC 5861 Расширения Cache-Control для устаревшего контента

source: Return stale content while revalidate
ru_ru: Возвращать устаревшее содержимое в процессе обновления

source: In seconds. A cached stale response <strong>may</strong> be used to satisfy the request, up to the indicated number of seconds, while source server request in progress. <a href="http://tools.ietf.org/html/rfc5861#section-3" target="_blank"><code>stale-while-revalidate</code></a> parameter of <code>Cache-Control</code> header.
ru_ru: (секунд). Разрешает кэшу отдавать устаревшее содержимое в течение указанного количества секунд, пока запрос на обновление к исходному серверу выполняется. Параметр <a href="http://tools.ietf.org/html/rfc5861#section-3" target="_blank"><code>stale-while-revalidate</code></a> заголовка <code>Cache-Control</code>.

source: Return stale content if error
ru_ru: Возвращать устаревшее содержимое при ошибке исходного сервера

source: In seconds. When an error is encountered (in source server response), a cached stale response <strong>may</strong> be used to satisfy the request, regardless of other freshness information. <a href="http://tools.ietf.org/html/rfc5861#section-4" target="_blank"><code>stale-if-error</code></a> parameter of <code>Cache-Control</code> header.
ru_ru: (секунд). Разрешает кэшу отдавать устаревшее содержимое в течение указанного количества секунд в случае ошибки исходного сервера при обновлении содержимого. Параметр <a href="http://tools.ietf.org/html/rfc5861#section-4" target="_blank"><code>stale-if-error</code></a> заголовка <code>Cache-Control</code>.

source: <p><a href="http://tools.ietf.org/html/rfc7234" target="_blank">RFC 7234</a> defines HTTP caches and the associated header fields that control cache behavior or indicate cacheable response messages.</p><p>Please, <a href="http://tools.ietf.org/html/rfc7234" target="_blank">read this document</a> before using this plugin.</p>
ru_ru: <p><a href="http://tools.ietf.org/html/rfc7234" target="_blank">RFC 7234</a> определяет заголовки HTTP, связанные с кешированием, а также заголовки, контролирующие поведение кэша или отражающие допустимость кеширования HTTP ответов.</p><p>Пожалуйста <a href="http://tools.ietf.org/html/rfc7234" target="_blank">прочитайте указанный документ</a> перед использованием данного плагина.</p>

source: <p><a href="http://tools.ietf.org/html/rfc5861" target="_blank">RFC 5861</a> defines two independent HTTP Cache-Control extensions that allow control over the use of stale responses by caches.</p>
ru_ru: <p><a href="http://tools.ietf.org/html/rfc5861" target="_blank">RFC 5861</a> определяет два независимых расширения <code>Cache-Control</code>, которые позволяют управлять использованием устаревшего содержимого кэша.</p>

source: Cache parameters
ru_ru: Параметры кэширования
